## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.bounce-rate-critical`            |
|        | `aws_cloudwatch_log_metric_filter.bounce-rate-warning`             |
|        | `aws_cloudwatch_metric_alarm.logs-1-bounce-rate-1-minute-critical` |
|        | `aws_cloudwatch_metric_alarm.logs-1-bounce-rate-1-minute-warning`  |
| update | `aws_cloudwatch_query_definition.bounce-rate-critical`             |
|        | `aws_cloudwatch_query_definition.bounce-rate-warning`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.bounce-rate-critical will be created
  + resource "aws_cloudwatch_log_metric_filter" "bounce-rate-critical" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name           = "bounce-rate-critical"
      + pattern        = "critical bounce rate threshold of 10"

      + metric_transformation {
          + name      = "bounce-rate-critical"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.bounce-rate-warning will be created
  + resource "aws_cloudwatch_log_metric_filter" "bounce-rate-warning" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name           = "bounce-rate-warning"
      + pattern        = "warning bounce rate threshold of 5"

      + metric_transformation {
          + name      = "bounce-rate-warning"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-bounce-rate-1-minute-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-bounce-rate-1-minute-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "One service exceeding 10% bounce rate in 1 minute"
      + alarm_name                            = "logs-1-critical-bounce-rate-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "bounce-rate-critical"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-1-bounce-rate-1-minute-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-bounce-rate-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One service exceeding 5% bounce rate in 1 minute"
      + alarm_name                            = "logs-1-warning-bounce-rate-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "bounce-rate-warning"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.bounce-rate-critical will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "bounce-rate-critical" {
        id                  = "47b22b08-eb4e-40dc-9cb1-753210b8dc1d"
        name                = "Critical bounces"
      ~ query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /admin|api/
          - | filter @message like "critical bounce rate threshold of 10%"
          + | filter @message like "critical bounce rate threshold of 10"
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.bounce-rate-warning will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "bounce-rate-warning" {
        id                  = "f46c9d2c-a282-45a0-b992-4b81dbcc4f06"
        name                = "Warning bounces"
      ~ query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /admin|api/
          - | filter @message like "warning bounce rate threshold of 5%"
          + | filter @message like "warning bounce rate threshold of 5"
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-beat-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
